src/Remora.Tests/Samples/SimpleHelloWorldRequest.xml

<?xml version="1.0" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/IHelloWorldService/HelloWorld</Action>
  </s:Header>
  <s:Body>
    <HelloWorldRequest xmlns="http://tempuri.org/" />
  </s:Body>
</s:Envelope>
